Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_rcc.h
#define RCC_CICR_HSECSSC                    (0x1U<<10)
#define RCC_CICR_LSECSSC                    (0x1U<<9)
#define RCC_CICR_PLL3RDYC                   (0x1U<<8)
#define RCC_CICR_PLL2RDYC                   (0x1U<<7)
#define RCC_CICR_PLL1RDYC                   (0x1U<<6)
#define RCC_CICR_RC48RDYC                   (0x1U<<5)
#define RCC_CICR_HSE_READY_INTERRUPT_CLEAR  (0x1U<<4)
#define RCC_CICR_HSERDYC                    (0x1U<<3)
#define RCC_CICR_HSIRDYC                    (0x1U<<2)
#define RCC_CICR_LSERDYC                    (0x1U<<1)
#define RCC_CICR_LSIRDYC                    (0x1U<<0)

// BDCR Configuration

#define RCC_BDCR_VSWRST                     (0x1U<<16)
#define RCC_BDCR_RTCEN                      (0x1U<<15)
#define RCC_BDCR_RTCSRC                     (0x3U<<8)
#define RCC_BDCR_RTCSRC_0                   (0x1U<<8)
#define RCC_BDCR_LSECSSD                    (0x1U<<6)
#define RCC_BDCR_LSECSSON                   (0x1U<<5)
#define RCC_BDCR_LSEDRV                     (0x3U<<3)
#define RCC_BDCR_LSEDRV_0                   (0x1U<<3)
#define RCC_BDCR_LSEBYP                     (0x1U<<2)
#define RCC_BDCR_LSERDY                     (0x1U<<1)
#define RCC_BDCR_LSEON                      (0x1U<<0)

// CSR Configuration

#define RCC_CSR_LSIRDY                      (0x1U<<1)
#define RCC_CSR_LSION                       (0x1U<<0)

// AHB3RSTR Configuration

#define RCC_AHB3RSTR_CPURST                 (0x1U<<31)
#define RCC_AHB3RSTR_SDMMC1RST              (0x1U<<16)
#define RCC_AHB3RSTR_QSPIRST                (0x1U<<14)
#define RCC_AHB3RSTR_FMCRST                 (0x1U<<12)
#define RCC_AHB3RSTR_JPGDECRST              (0x1U<<5)
#define RCC_AHB3RSTR_DMA2DRST               (0x1U<<4)
#define RCC_AHB3RSTR_MDMARST                (0x1U<<0)

// AHB1RSTR Configuration

#define RCC_AHB1RSTR_USB2OTGRST             (0x1U<<27)
#define RCC_AHB1RSTR_USB1OTGRST             (0x1U<<25)
#define RCC_AHB1RSTR_ETH1MACRST             (0x1U<<15)
#define RCC_AHB1RSTR_ADC12RST               (0x1U<<5)
#define RCC_AHB1RSTR_DMA2RST                (0x1U<<1)
#define RCC_AHB1RSTR_DMA1RST                (0x1U<<0)

// AHB2RSTR Configuration

#define RCC_AHB2RSTR_SDMMC2RST              (0x1U<<9)
#define RCC_AHB2RSTR_RNGRST                 (0x1U<<6)
#define RCC_AHB2RSTR_HASHRST                (0x1U<<5)
#define RCC_AHB2RSTR_CRYPTRST               (0x1U<<4)
#define RCC_AHB2RSTR_CAMITFRST              (0x1U<<0)

// AHB4RSTR Configuration

#define RCC_AHB4RSTR_HSEMRST                (0x1U<<25)
#define RCC_AHB4RSTR_ADC3RST                (0x1U<<24)
#define RCC_AHB4RSTR_BDMARST                (0x1U<<21)
#define RCC_AHB4RSTR_CRCRST                 (0x1U<<19)
#define RCC_AHB4RSTR_GPIOKRST               (0x1U<<10)
#define RCC_AHB4RSTR_GPIOJRST               (0x1U<<9)
#define RCC_AHB4RSTR_GPIOIRST               (0x1U<<8)
#define RCC_AHB4RSTR_GPIOHRST               (0x1U<<7)
#define RCC_AHB4RSTR_GPIOGRST               (0x1U<<6)
#define RCC_AHB4RSTR_GPIOFRST               (0x1U<<5)
#define RCC_AHB4RSTR_GPIOERST               (0x1U<<4)
#define RCC_AHB4RSTR_GPIODRST               (0x1U<<3)
#define RCC_AHB4RSTR_GPIOCRST               (0x1U<<2)
#define RCC_AHB4RSTR_GPIOBRST               (0x1U<<1)
#define RCC_AHB4RSTR_GPIOARST               (0x1U<<0)

// APB3RSTR Configuration

#define RCC_APB3RSTR_LTDCRST                (0x1U<<3)

// APB1LRSTR Configuration

#define RCC_APB1LRSTR_USART8RST             (0x1U<<31)
#define RCC_APB1LRSTR_USART7RST             (0x1U<<30)
#define RCC_APB1LRSTR_DAC12RST              (0x1U<<29)
#define RCC_APB1LRSTR_HDMICECRST            (0x1U<<27)
#define RCC_APB1LRSTR_I2C3RST               (0x1U<<23)
#define RCC_APB1LRSTR_I2C2RST               (0x1U<<22)
#define RCC_APB1LRSTR_I2C1RST               (0x1U<<21)
#define RCC_APB1LRSTR_UART5RST              (0x1U<<20)
#define RCC_APB1LRSTR_UART4RST              (0x1U<<19)
#define RCC_APB1LRSTR_USART3RST             (0x1U<<18)
#define RCC_APB1LRSTR_USART2RST             (0x1U<<17)
#define RCC_APB1LRSTR_SPDIFRXRST            (0x1U<<16)
#define RCC_APB1LRSTR_SPI3RST               (0x1U<<15)
#define RCC_APB1LRSTR_SPI2RST               (0x1U<<14)
#define RCC_APB1LRSTR_LPTIM1RST             (0x1U<<9)
#define RCC_APB1LRSTR_TIM14RST              (0x1U<<8)
#define RCC_APB1LRSTR_TIM13RST              (0x1U<<7)
#define RCC_APB1LRSTR_TIM12RST              (0x1U<<6)
#define RCC_APB1LRSTR_TIM7RST               (0x1U<<5)
#define RCC_APB1LRSTR_TIM6RST               (0x1U<<4)
#define RCC_APB1LRSTR_TIM5RST               (0x1U<<3)
#define RCC_APB1LRSTR_TIM4RST               (0x1U<<2)
#define RCC_APB1LRSTR_TIM3RST               (0x1U<<1)
#define RCC_APB1LRSTR_TIM2RST               (0x1U<<0)

// APB1HRSTR Configuration

#define RCC_APB1HRSTR_FDCANRST              (0x1U<<8)
#define RCC_APB1HRSTR_MDIOSRST              (0x1U<<5)
#define RCC_APB1HRSTR_OPAMPRST              (0x1U<<4)
#define RCC_APB1HRSTR_SWPRST                (0x1U<<2)
#define RCC_APB1HRSTR_CRSRST                (0x1U<<1)

// APB2RSTR Configuration

#define RCC_APB2RSTR_HRTIMRST               (0x1U<<29)
#define RCC_APB2RSTR_DFSDM1RST              (0x1U<<28)
#define RCC_APB2RSTR_SAI3RST                (0x1U<<24)
#define RCC_APB2RSTR_SAI2RST                (0x1U<<23)
#define RCC_APB2RSTR_SAI1RST                (0x1U<<22)
#define RCC_APB2RSTR_SPI5RST                (0x1U<<20)
#define RCC_APB2RSTR_TIM17RST               (0x1U<<18)
#define RCC_APB2RSTR_TIM16RST               (0x1U<<17)
#define RCC_APB2RSTR_TIM15RST               (0x1U<<16)
#define RCC_APB2RSTR_SPI4RST                (0x1U<<13)
#define RCC_APB2RSTR_SPI1RST                (0x1U<<12)
#define RCC_APB2RSTR_USART6RST              (0x1U<<5)
#define RCC_APB2RSTR_USART1RST              (0x1U<<4)
#define RCC_APB2RSTR_TIM8RST                (0x1U<<1)
#define RCC_APB2RSTR_TIM1RST                (0x1U<<0)

// APB4RSTR Configuration

#define RCC_APB4RSTR_SAI4RST                (0x1U<<21)
#define RCC_APB4RSTR_VREFRST                (0x1U<<15)
#define RCC_APB4RSTR_COMP12RST              (0x1U<<14)
#define RCC_APB4RSTR_LPTIM5RST              (0x1U<<12)
#define RCC_APB4RSTR_LPTIM4RST              (0x1U<<11)
#define RCC_APB4RSTR_LPTIM3RST              (0x1U<<10)
#define RCC_APB4RSTR_LPTIM2RST              (0x1U<<9)
#define RCC_APB4RSTR_I2C4RST                (0x1U<<7)
#define RCC_APB4RSTR_SPI6RST                (0x1U<<5)
#define RCC_APB4RSTR_LPUART1RST             (0x1U<<3)
#define RCC_APB4RSTR_SYSCFGRST              (0x1U<<1)

// GCR Configuration

