Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_rcc.h
#define RCC_GCR_WW1RSC                      (0x1U<<0)

// D3AMR Configuration

#define RCC_D3AMR_SRAM4AMEN                 (0x1U<<29)
#define RCC_D3AMR_BKPSRAMAMEN               (0x1U<<28)
#define RCC_D3AMR_ADC3AMEN                  (0x1U<<24)
#define RCC_D3AMR_SAI4AMEN                  (0x1U<<21)
#define RCC_D3AMR_CRCAMEN                   (0x1U<<19)
#define RCC_D3AMR_RTCAMEN                   (0x1U<<16)
#define RCC_D3AMR_VREFAMEN                  (0x1U<<15)
#define RCC_D3AMR_COMP12AMEN                (0x1U<<14)
#define RCC_D3AMR_LPTIM5AMEN                (0x1U<<12)
#define RCC_D3AMR_LPTIM4AMEN                (0x1U<<11)
#define RCC_D3AMR_LPTIM3AMEN                (0x1U<<10)
#define RCC_D3AMR_LPTIM2AMEN                (0x1U<<9)
#define RCC_D3AMR_I2C4AMEN                  (0x1U<<7)
#define RCC_D3AMR_SPI6AMEN                  (0x1U<<5)
#define RCC_D3AMR_LPUART1AMEN               (0x1U<<3)
#define RCC_D3AMR_BDMAAMEN                  (0x1U<<0)

// RSR Configuration

#define RCC_RSR_LPWRRSTF                    (0x1U<<30)
#define RCC_RSR_WWDG1RSTF                   (0x1U<<28)
#define RCC_RSR_IWDG1RSTF                   (0x1U<<26)
#define RCC_RSR_SFTRSTF                     (0x1U<<24)
#define RCC_RSR_PORRSTF                     (0x1U<<23)
#define RCC_RSR_PINRSTF                     (0x1U<<22)
#define RCC_RSR_BORRSTF                     (0x1U<<21)
#define RCC_RSR_D2RSTF                      (0x1U<<20)
#define RCC_RSR_D1RSTF                      (0x1U<<19)
#define RCC_RSR_CPURSTF                     (0x1U<<17)
#define RCC_RSR_RMVF                        (0x1U<<16)

// AHB3ENR Configuration

#define RCC_AHB3ENR_SDMMC1EN                (0x1U<<16)
#define RCC_AHB3ENR_QSPIEN                  (0x1U<<14)
#define RCC_AHB3ENR_FMCEN                   (0x1U<<12)
#define RCC_AHB3ENR_JPGDECEN                (0x1U<<5)
#define RCC_AHB3ENR_DMA2DEN                 (0x1U<<4)
#define RCC_AHB3ENR_MDMAEN                  (0x1U<<0)

// AHB1ENR Configuration

#define RCC_AHB1ENR_USB2ULPIEN              (0x1U<<28)
#define RCC_AHB1ENR_USB2OTGEN               (0x1U<<27)
#define RCC_AHB1ENR_USB1ULPIEN              (0x1U<<26)
#define RCC_AHB1ENR_USB1OTGEN               (0x1U<<25)
#define RCC_AHB1ENR_ETH1RXEN                (0x1U<<17)
#define RCC_AHB1ENR_ETH1TXEN                (0x1U<<16)
#define RCC_AHB1ENR_ETH1MACEN               (0x1U<<15)
#define RCC_AHB1ENR_ADC12EN                 (0x1U<<5)
#define RCC_AHB1ENR_DMA2EN                  (0x1U<<1)
#define RCC_AHB1ENR_DMA1EN                  (0x1U<<0)

// AHB2ENR Configuration

#define RCC_AHB2ENR_SRAM3EN                 (0x1U<<31)
#define RCC_AHB2ENR_SRAM2EN                 (0x1U<<30)
#define RCC_AHB2ENR_SRAM1EN                 (0x1U<<29)
#define RCC_AHB2ENR_SDMMC2EN                (0x1U<<9)
#define RCC_AHB2ENR_RNGEN                   (0x1U<<6)
#define RCC_AHB2ENR_HASHEN                  (0x1U<<5)
#define RCC_AHB2ENR_CRYPTEN                 (0x1U<<4)
#define RCC_AHB2ENR_CAMITFEN                (0x1U<<0)

// AHB4ENR Configuration

#define RCC_AHB4ENR_BKPRAMEN                (0x1U<<28)
#define RCC_AHB4ENR_HSEMEN                  (0x1U<<25)
#define RCC_AHB4ENR_ADC3EN                  (0x1U<<24)
#define RCC_AHB4ENR_BDMAEN                  (0x1U<<21)
#define RCC_AHB4ENR_CRCEN                   (0x1U<<19)
#define RCC_AHB4ENR_GPIOKEN                 (0x1U<<10)
#define RCC_AHB4ENR_GPIOJEN                 (0x1U<<9)
#define RCC_AHB4ENR_GPIOIEN                 (0x1U<<8)
#define RCC_AHB4ENR_GPIOHEN                 (0x1U<<7)
#define RCC_AHB4ENR_GPIOGEN                 (0x1U<<6)
#define RCC_AHB4ENR_GPIOFEN                 (0x1U<<5)
#define RCC_AHB4ENR_GPIOEEN                 (0x1U<<4)
#define RCC_AHB4ENR_GPIODEN                 (0x1U<<3)
#define RCC_AHB4ENR_GPIOCEN                 (0x1U<<2)
#define RCC_AHB4ENR_GPIOBEN                 (0x1U<<1)
#define RCC_AHB4ENR_GPIOAEN                 (0x1U<<0)

// APB3ENR Configuration

#define RCC_APB3ENR_WWDG1EN                 (0x1U<<6)
#define RCC_APB3ENR_LTDCEN                  (0x1U<<3)

// APB1LENR Configuration

#define RCC_APB1LENR_USART8EN               (0x1U<<31)
#define RCC_APB1LENR_USART7EN               (0x1U<<30)
#define RCC_APB1LENR_DAC12EN                (0x1U<<29)
#define RCC_APB1LENR_HDMICECEN              (0x1U<<27)
#define RCC_APB1LENR_I2C3EN                 (0x1U<<23)
#define RCC_APB1LENR_I2C2EN                 (0x1U<<22)
#define RCC_APB1LENR_I2C1EN                 (0x1U<<21)
#define RCC_APB1LENR_UART5EN                (0x1U<<20)
#define RCC_APB1LENR_UART4EN                (0x1U<<19)
#define RCC_APB1LENR_USART3EN               (0x1U<<18)
#define RCC_APB1LENR_USART2EN               (0x1U<<17)
#define RCC_APB1LENR_SPDIFRXEN              (0x1U<<16)
#define RCC_APB1LENR_SPI3EN                 (0x1U<<15)
#define RCC_APB1LENR_SPI2EN                 (0x1U<<14)
#define RCC_APB1LENR_LPTIM1EN               (0x1U<<9)
#define RCC_APB1LENR_TIM14EN                (0x1U<<8)
#define RCC_APB1LENR_TIM13EN                (0x1U<<7)
#define RCC_APB1LENR_TIM12EN                (0x1U<<6)
#define RCC_APB1LENR_TIM7EN                 (0x1U<<5)
#define RCC_APB1LENR_TIM6EN                 (0x1U<<4)
#define RCC_APB1LENR_TIM5EN                 (0x1U<<3)
#define RCC_APB1LENR_TIM4EN                 (0x1U<<2)
#define RCC_APB1LENR_TIM3EN                 (0x1U<<1)
#define RCC_APB1LENR_TIM2EN                 (0x1U<<0)

// APB1HENR Configuration

#define RCC_APB1HENR_FDCANEN                (0x1U<<8)
#define RCC_APB1HENR_MDIOSEN                (0x1U<<5)
#define RCC_APB1HENR_OPAMPEN                (0x1U<<4)
#define RCC_APB1HENR_SWPEN                  (0x1U<<2)
#define RCC_APB1HENR_CRSEN                  (0x1U<<1)

// APB2ENR Configuration

#define RCC_APB2ENR_HRTIMEN                 (0x1U<<29)
#define RCC_APB2ENR_DFSDM1EN                (0x1U<<28)
#define RCC_APB2ENR_SAI3EN                  (0x1U<<24)
#define RCC_APB2ENR_SAI2EN                  (0x1U<<23)
#define RCC_APB2ENR_SAI1EN                  (0x1U<<22)
#define RCC_APB2ENR_SPI5EN                  (0x1U<<20)
#define RCC_APB2ENR_TIM17EN                 (0x1U<<18)
#define RCC_APB2ENR_TIM15EN                 (0x1U<<16)
#define RCC_APB2ENR_TIM16EN                 (0x1U<<17)
#define RCC_APB2ENR_SPI4EN                  (0x1U<<13)
#define RCC_APB2ENR_SPI1EN                  (0x1U<<12)
#define RCC_APB2ENR_USART6EN                (0x1U<<5)
#define RCC_APB2ENR_USART1EN                (0x1U<<4)
#define RCC_APB2ENR_TIM8EN                  (0x1U<<1)
#define RCC_APB2ENR_TIM1EN                  (0x1U<<0)

// APB4ENR Configuration

#define RCC_APB4ENR_SAI4EN                  (0x1U<<21)
#define RCC_APB4ENR_RTCAPBEN                (0x1U<<16)
#define RCC_APB4ENR_VREFEN                  (0x1U<<15)
#define RCC_APB4ENR_COMP12EN                (0x1U<<14)
#define RCC_APB4ENR_LPTIM5EN                (0x1U<<12)
#define RCC_APB4ENR_LPTIM4EN                (0x1U<<11)
#define RCC_APB4ENR_LPTIM3EN                (0x1U<<10)
#define RCC_APB4ENR_LPTIM2EN                (0x1U<<9)
#define RCC_APB4ENR_I2C4EN                  (0x1U<<7)
#define RCC_APB4ENR_SPI6EN                  (0x1U<<5)
#define RCC_APB4ENR_LPUART1EN               (0x1U<<3)
#define RCC_APB4ENR_SYSCFGEN                (0x1U<<1)

// AHB3LPENR Configuration

#define RCC_AHB3LPENR_AXISRAMLPEN           (0x1U<<31)
#define RCC_AHB3LPENR_ITCMLPEN              (0x1U<<30)
#define RCC_AHB3LPENR_DTCM2LPEN             (0x1U<<29)
#define RCC_AHB3LPENR_D1DTCM1LPEN           (0x1U<<28)
#define RCC_AHB3LPENR_SDMMC1LPEN            (0x1U<<16)
#define RCC_AHB3LPENR_QSPILPEN              (0x1U<<14)
#define RCC_AHB3LPENR_FMCLPEN               (0x1U<<12)
#define RCC_AHB3LPENR_FLITFLPEN             (0x1U<<8)
#define RCC_AHB3LPENR_JPGDECLPEN            (0x1U<<5)
#define RCC_AHB3LPENR_DMA2DLPEN             (0x1U<<4)
#define RCC_AHB3LPENR_MDMALPEN              (0x1U<<0)

// AHB1LPENR Configuration

#define RCC_AHB1LPENR_USB2ULPILPEN          (0x1U<<28)
#define RCC_AHB1LPENR_USB2OTGLPEN           (0x1U<<27)
#define RCC_AHB1LPENR_USB1ULPILPEN          (0x1U<<26)
#define RCC_AHB1LPENR_USB1OTGLPEN           (0x1U<<25)
#define RCC_AHB1LPENR_ETH1RXLPEN            (0x1U<<17)
#define RCC_AHB1LPENR_ETH1TXLPEN            (0x1U<<16)
#define RCC_AHB1LPENR_ETH1MACLPEN           (0x1U<<15)
#define RCC_AHB1LPENR_ADC12LPEN             (0x1U<<5)
#define RCC_AHB1LPENR_DMA2LPEN              (0x1U<<1)
#define RCC_AHB1LPENR_DMA1LPEN              (0x1U<<0)

