Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_rcc.h
// AHB2LPENR Configuration

#define RCC_AHB2LPENR_SRAM3LPEN             (0x1U<<31)
#define RCC_AHB2LPENR_SRAM2LPEN             (0x1U<<30)
#define RCC_AHB2LPENR_SRAM1LPEN             (0x1U<<29)
#define RCC_AHB2LPENR_RNGLPEN               (0x1U<<6)
#define RCC_AHB2LPENR_SDMMC2LPEN            (0x1U<<9)
#define RCC_AHB2LPENR_HASHLPEN              (0x1U<<5)
#define RCC_AHB2LPENR_CRYPTLPEN             (0x1U<<4)
#define RCC_AHB2LPENR_CAMITFLPEN            (0x1U<<0)

// AHB4LPENR Configuration

#define RCC_AHB4LPENR_SRAM4LPEN             (0x1U<<29)
#define RCC_AHB4LPENR_BKPRAMLPEN            (0x1U<<28)
#define RCC_AHB4LPENR_ADC3LPEN              (0x1U<<24)
#define RCC_AHB4LPENR_BDMALPEN              (0x1U<<21)
#define RCC_AHB4LPENR_CRCLPEN               (0x1U<<19)
#define RCC_AHB4LPENR_GPIOKLPEN             (0x1U<<10)
#define RCC_AHB4LPENR_GPIOJLPEN             (0x1U<<9)
#define RCC_AHB4LPENR_GPIOILPEN             (0x1U<<8)
#define RCC_AHB4LPENR_GPIOHLPEN             (0x1U<<7)
#define RCC_AHB4LPENR_GPIOGLPEN             (0x1U<<6)
#define RCC_AHB4LPENR_GPIOFLPEN             (0x1U<<5)
#define RCC_AHB4LPENR_GPIOELPEN             (0x1U<<4)
#define RCC_AHB4LPENR_GPIODLPEN             (0x1U<<3)
#define RCC_AHB4LPENR_GPIOCLPEN             (0x1U<<2)
#define RCC_AHB4LPENR_GPIOBLPEN             (0x1U<<1)
#define RCC_AHB4LPENR_GPIOALPEN             (0x1U<<0)

// APB3LPENR Configuration

#define RCC_APB3LPENR_WWDG1LPEN             (0x1U<<6)
#define RCC_APB3LPENR_LTDCLPEN              (0x1U<<3)

// APB1LLPENR Configuration

#define RCC_APB1LLPENR_USART8LPEN           (0x1U<<31)
#define RCC_APB1LLPENR_USART7LPEN           (0x1U<<30)
#define RCC_APB1LLPENR_DAC12LPEN            (0x1U<<29)
#define RCC_APB1LLPENR_HDMICECLPEN          (0x1U<<27)
#define RCC_APB1LLPENR_I2C3LPEN             (0x1U<<23)
#define RCC_APB1LLPENR_I2C2LPEN             (0x1U<<22)
#define RCC_APB1LLPENR_I2C1LPEN             (0x1U<<21)
#define RCC_APB1LLPENR_UART5LPEN            (0x1U<<20)
#define RCC_APB1LLPENR_UART4LPEN            (0x1U<<19)
#define RCC_APB1LLPENR_USART3LPEN           (0x1U<<18)
#define RCC_APB1LLPENR_USART2LPEN           (0x1U<<17)
#define RCC_APB1LLPENR_SPDIFRXLPEN          (0x1U<<16)
#define RCC_APB1LLPENR_SPI3LPEN             (0x1U<<15)
#define RCC_APB1LLPENR_SPI2LPEN             (0x1U<<14)
#define RCC_APB1LLPENR_LPTIM1LPEN           (0x1U<<9)
#define RCC_APB1LLPENR_TIM14LPEN            (0x1U<<8)
#define RCC_APB1LLPENR_TIM13LPEN            (0x1U<<7)
#define RCC_APB1LLPENR_TIM12LPEN            (0x1U<<6)
#define RCC_APB1LLPENR_TIM7LPEN             (0x1U<<5)
#define RCC_APB1LLPENR_TIM6LPEN             (0x1U<<4)
#define RCC_APB1LLPENR_TIM5LPEN             (0x1U<<3)
#define RCC_APB1LLPENR_TIM4LPEN             (0x1U<<2)
#define RCC_APB1LLPENR_TIM3LPEN             (0x1U<<1)
#define RCC_APB1LLPENR_TIM2LPEN             (0x1U<<0)

// APB1HLPENR Configuration

#define RCC_APB1HLPENR_FDCANLPEN            (0x1U<<8)
#define RCC_APB1HLPENR_MDIOSLPEN            (0x1U<<5)
#define RCC_APB1HLPENR_OPAMPLPEN            (0x1U<<4)
#define RCC_APB1HLPENR_SWPLPEN              (0x1U<<2)
#define RCC_APB1HLPENR_CRSLPEN              (0x1U<<1)

// APB2LPENR Configuration

#define RCC_APB2LPENR_HRTIMLPEN             (0x1U<<29)
#define RCC_APB2LPENR_DFSDM1LPEN            (0x1U<<28)
#define RCC_APB2LPENR_SAI3LPEN              (0x1U<<24)
#define RCC_APB2LPENR_SAI2LPEN              (0x1U<<23)
#define RCC_APB2LPENR_SAI1LPEN              (0x1U<<22)
#define RCC_APB2LPENR_SPI5LPEN              (0x1U<<20)
#define RCC_APB2LPENR_TIM17LPEN             (0x1U<<18)
#define RCC_APB2LPENR_TIM16LPEN             (0x1U<<17)
#define RCC_APB2LPENR_TIM15LPEN             (0x1U<<16)
#define RCC_APB2LPENR_SPI4LPEN              (0x1U<<13)
#define RCC_APB2LPENR_SPI1LPEN              (0x1U<<12)
#define RCC_APB2LPENR_USART6LPEN            (0x1U<<5)
#define RCC_APB2LPENR_USART1LPEN            (0x1U<<4)
#define RCC_APB2LPENR_TIM8LPEN              (0x1U<<1)
#define RCC_APB2LPENR_TIM1LPEN              (0x1U<<0)

// APB4LPENR Configuration

#define RCC_APB4LPENR_SAI4LPEN              (0x1U<<21)
#define RCC_APB4LPENR_RTCAPBLPEN            (0x1U<<16)
#define RCC_APB4LPENR_VREFLPEN              (0x1U<<15)
#define RCC_APB4LPENR_COMP12LPEN            (0x1U<<14)
#define RCC_APB4LPENR_LPTIM5LPEN            (0x1U<<12)
#define RCC_APB4LPENR_LPTIM4LPEN            (0x1U<<11)
#define RCC_APB4LPENR_LPTIM3LPEN            (0x1U<<10)
#define RCC_APB4LPENR_LPTIM2LPEN            (0x1U<<9)
#define RCC_APB4LPENR_I2C4LPEN              (0x1U<<7)
#define RCC_APB4LPENR_SPI6LPEN              (0x1U<<5)
#define RCC_APB4LPENR_LPUART1LPEN           (0x1U<<3)
#define RCC_APB4LPENR_SYSCFGLPEN            (0x1U<<1)

// C1_RSR Configuration

#define RCC_C1_RSR_LPWRRSTF                 (0x1U<<30)
#define RCC_C1_RSR_WWDG1RSTF                (0x1U<<28)
#define RCC_C1_RSR_IWDG1RSTF                (0x1U<<26)
#define RCC_C1_RSR_SFTRSTF                  (0x1U<<24)
#define RCC_C1_RSR_PORRSTF                  (0x1U<<23)
#define RCC_C1_RSR_PINRSTF                  (0x1U<<22)
#define RCC_C1_RSR_BORRSTF                  (0x1U<<21)
#define RCC_C1_RSR_D2RSTF                   (0x1U<<20)
#define RCC_C1_RSR_D1RSTF                   (0x1U<<19)
#define RCC_C1_RSR_CPURSTF                  (0x1U<<17)
#define RCC_C1_RSR_RMVF                     (0x1U<<16)

// C1_AHB3ENR Configuration

#define RCC_C1_AHB3ENR_SDMMC1EN             (0x1U<<16)
#define RCC_C1_AHB3ENR_QSPIEN               (0x1U<<14)
#define RCC_C1_AHB3ENR_FMCEN                (0x1U<<12)
#define RCC_C1_AHB3ENR_JPGDECEN             (0x1U<<5)
#define RCC_C1_AHB3ENR_DMA2DEN              (0x1U<<4)
#define RCC_C1_AHB3ENR_MDMAEN               (0x1U<<0)

// C1_AHB1ENR Configuration

#define RCC_C1_AHB1ENR_USB2ULPIEN           (0x1U<<28)
#define RCC_C1_AHB1ENR_USB2OTGEN            (0x1U<<27)
#define RCC_C1_AHB1ENR_USB1ULPIEN           (0x1U<<26)
#define RCC_C1_AHB1ENR_USB1OTGEN            (0x1U<<25)
#define RCC_C1_AHB1ENR_ETH1RXEN             (0x1U<<17)
#define RCC_C1_AHB1ENR_ETH1TXEN             (0x1U<<16)
#define RCC_C1_AHB1ENR_ETH1MACEN            (0x1U<<15)
#define RCC_C1_AHB1ENR_ADC12EN              (0x1U<<5)
#define RCC_C1_AHB1ENR_DMA2EN               (0x1U<<1)
#define RCC_C1_AHB1ENR_DMA1EN               (0x1U<<0)

// C1_AHB2ENR Configuration

#define RCC_C1_AHB2ENR_SRAM3EN              (0x1U<<31)
#define RCC_C1_AHB2ENR_SRAM2EN              (0x1U<<30)
#define RCC_C1_AHB2ENR_SRAM1EN              (0x1U<<29)
#define RCC_C1_AHB2ENR_SDMMC2EN             (0x1U<<9)
#define RCC_C1_AHB2ENR_RNGEN                (0x1U<<6)
#define RCC_C1_AHB2ENR_HASHEN               (0x1U<<5)
#define RCC_C1_AHB2ENR_CRYPTEN              (0x1U<<4)
#define RCC_C1_AHB2ENR_CAMITFEN             (0x1U<<0)

// C1_AHB4ENR Configuration

#define RCC_C1_AHB4ENR_BKPRAMEN             (0x1U<<28)
#define RCC_C1_AHB4ENR_HSEMEN               (0x1U<<25)
#define RCC_C1_AHB4ENR_ADC3EN               (0x1U<<24)
#define RCC_C1_AHB4ENR_BDMAEN               (0x1U<<21)
#define RCC_C1_AHB4ENR_CRCEN                (0x1U<<19)
#define RCC_C1_AHB4ENR_GPIOKEN              (0x1U<<10)
#define RCC_C1_AHB4ENR_GPIOJEN              (0x1U<<9)
#define RCC_C1_AHB4ENR_GPIOIEN              (0x1U<<8)
#define RCC_C1_AHB4ENR_GPIOHEN              (0x1U<<7)
#define RCC_C1_AHB4ENR_GPIOGEN              (0x1U<<6)
#define RCC_C1_AHB4ENR_GPIOFEN              (0x1U<<5)
#define RCC_C1_AHB4ENR_GPIOEEN              (0x1U<<4)
#define RCC_C1_AHB4ENR_GPIODEN              (0x1U<<3)
#define RCC_C1_AHB4ENR_GPIOCEN              (0x1U<<2)
#define RCC_C1_AHB4ENR_GPIOBEN              (0x1U<<1)
#define RCC_C1_AHB4ENR_GPIOAEN              (0x1U<<0)

