Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_rcc.h
// C1_APB3ENR Configuration

#define RCC_C1_APB3ENR_WWDG1EN              (0x1U<<6)
#define RCC_C1_APB3ENR_LTDCEN               (0x1U<<3)

// C1_APB1LENR Configuration

#define RCC_C1_APB1LENR_USART8EN            (0x1U<<31)
#define RCC_C1_APB1LENR_USART7EN            (0x1U<<30)
#define RCC_C1_APB1LENR_DAC12EN             (0x1U<<29)
#define RCC_C1_APB1LENR_HDMICECEN           (0x1U<<27)
#define RCC_C1_APB1LENR_I2C3EN              (0x1U<<23)
#define RCC_C1_APB1LENR_I2C2EN              (0x1U<<22)
#define RCC_C1_APB1LENR_I2C1EN              (0x1U<<21)
#define RCC_C1_APB1LENR_UART5EN             (0x1U<<20)
#define RCC_C1_APB1LENR_UART4EN             (0x1U<<19)
#define RCC_C1_APB1LENR_USART3EN            (0x1U<<18)
#define RCC_C1_APB1LENR_USART2EN            (0x1U<<17)
#define RCC_C1_APB1LENR_SPDIFRXEN           (0x1U<<16)
#define RCC_C1_APB1LENR_SPI3EN              (0x1U<<15)
#define RCC_C1_APB1LENR_SPI2EN              (0x1U<<14)
#define RCC_C1_APB1LENR_LPTIM1EN            (0x1U<<9)
#define RCC_C1_APB1LENR_TIM14EN             (0x1U<<8)
#define RCC_C1_APB1LENR_TIM13EN             (0x1U<<7)
#define RCC_C1_APB1LENR_TIM12EN             (0x1U<<6)
#define RCC_C1_APB1LENR_TIM7EN              (0x1U<<5)
#define RCC_C1_APB1LENR_TIM6EN              (0x1U<<4)
#define RCC_C1_APB1LENR_TIM5EN              (0x1U<<3)
#define RCC_C1_APB1LENR_TIM4EN              (0x1U<<2)
#define RCC_C1_APB1LENR_TIM3EN              (0x1U<<1)
#define RCC_C1_APB1LENR_TIM2EN              (0x1U<<0)

// C1_APB1HENR Configuration

#define RCC_C1_APB1HENR_FDCANEN             (0x1U<<8)
#define RCC_C1_APB1HENR_MDIOSEN             (0x1U<<5)
#define RCC_C1_APB1HENR_OPAMPEN             (0x1U<<4)
#define RCC_C1_APB1HENR_SWPEN               (0x1U<<2)
#define RCC_C1_APB1HENR_CRSEN               (0x1U<<1)

// C1_APB2ENR Configuration

#define RCC_C1_APB2ENR_HRTIMEN              (0x1U<<29)
#define RCC_C1_APB2ENR_DFSDM1EN             (0x1U<<28)
#define RCC_C1_APB2ENR_SAI3EN               (0x1U<<24)
#define RCC_C1_APB2ENR_SAI2EN               (0x1U<<23)
#define RCC_C1_APB2ENR_SAI1EN               (0x1U<<22)
#define RCC_C1_APB2ENR_SPI5EN               (0x1U<<20)
#define RCC_C1_APB2ENR_TIM17EN              (0x1U<<18)
#define RCC_C1_APB2ENR_TIM15EN              (0x1U<<16)
#define RCC_C1_APB2ENR_TIM16EN              (0x1U<<17)
#define RCC_C1_APB2ENR_SPI4EN               (0x1U<<13)
#define RCC_C1_APB2ENR_SPI1EN               (0x1U<<12)
#define RCC_C1_APB2ENR_USART6EN             (0x1U<<5)
#define RCC_C1_APB2ENR_USART1EN             (0x1U<<4)
#define RCC_C1_APB2ENR_TIM8EN               (0x1U<<1)
#define RCC_C1_APB2ENR_TIM1EN               (0x1U<<0)

// C1_APB4ENR Configuration

#define RCC_C1_APB4ENR_SAI4EN               (0x1U<<21)
#define RCC_C1_APB4ENR_RTCAPBEN             (0x1U<<16)
#define RCC_C1_APB4ENR_VREFEN               (0x1U<<15)
#define RCC_C1_APB4ENR_COMP12EN             (0x1U<<14)
#define RCC_C1_APB4ENR_LPTIM5EN             (0x1U<<12)
#define RCC_C1_APB4ENR_LPTIM4EN             (0x1U<<11)
#define RCC_C1_APB4ENR_LPTIM3EN             (0x1U<<10)
#define RCC_C1_APB4ENR_LPTIM2EN             (0x1U<<9)
#define RCC_C1_APB4ENR_I2C4EN               (0x1U<<7)
#define RCC_C1_APB4ENR_SPI6EN               (0x1U<<5)
#define RCC_C1_APB4ENR_LPUART1EN            (0x1U<<3)
#define RCC_C1_APB4ENR_SYSCFGEN             (0x1U<<1)

// C1_AHB3LPENR Configuration

#define RCC_C1_AHB3LPENR_AXISRAMLPEN        (0x1U<<31)
#define RCC_C1_AHB3LPENR_ITCMLPEN           (0x1U<<30)
#define RCC_C1_AHB3LPENR_DTCM2LPEN          (0x1U<<29)
#define RCC_C1_AHB3LPENR_D1DTCM1LPEN        (0x1U<<28)
#define RCC_C1_AHB3LPENR_SDMMC1LPEN         (0x1U<<16)
#define RCC_C1_AHB3LPENR_QSPILPEN           (0x1U<<14)
#define RCC_C1_AHB3LPENR_FMCLPEN            (0x1U<<12)
#define RCC_C1_AHB3LPENR_FLITFLPEN          (0x1U<<8)
#define RCC_C1_AHB3LPENR_JPGDECLPEN         (0x1U<<5)
#define RCC_C1_AHB3LPENR_DMA2DLPEN          (0x1U<<4)
#define RCC_C1_AHB3LPENR_MDMALPEN           (0x1U<<0)

// C1_AHB1LPENR Configuration

#define RCC_C1_AHB1LPENR_USB2ULPILPEN       (0x1U<<28)
#define RCC_C1_AHB1LPENR_USB2OTGLPEN        (0x1U<<27)
#define RCC_C1_AHB1LPENR_USB1ULPILPEN       (0x1U<<26)
#define RCC_C1_AHB1LPENR_USB1OTGLPEN        (0x1U<<25)
#define RCC_C1_AHB1LPENR_ETH1RXLPEN         (0x1U<<17)
#define RCC_C1_AHB1LPENR_ETH1TXLPEN         (0x1U<<16)
#define RCC_C1_AHB1LPENR_ETH1MACLPEN        (0x1U<<15)
#define RCC_C1_AHB1LPENR_ADC12LPEN          (0x1U<<5)
#define RCC_C1_AHB1LPENR_DMA2LPEN           (0x1U<<1)
#define RCC_C1_AHB1LPENR_DMA1LPEN           (0x1U<<0)

// C1_AHB2LPENR Configuration

#define RCC_C1_AHB2LPENR_SRAM3LPEN          (0x1U<<31)
#define RCC_C1_AHB2LPENR_SRAM2LPEN          (0x1U<<30)
#define RCC_C1_AHB2LPENR_SRAM1LPEN          (0x1U<<29)
#define RCC_C1_AHB2LPENR_RNGLPEN            (0x1U<<6)
#define RCC_C1_AHB2LPENR_SDMMC2LPEN         (0x1U<<9)
#define RCC_C1_AHB2LPENR_HASHLPEN           (0x1U<<5)
#define RCC_C1_AHB2LPENR_CRYPTLPEN          (0x1U<<4)
#define RCC_C1_AHB2LPENR_CAMITFLPEN         (0x1U<<0)

// C1_AHB4LPENR Configuration

#define RCC_C1_AHB4LPENR_SRAM4LPEN          (0x1U<<29)
#define RCC_C1_AHB4LPENR_BKPRAMLPEN         (0x1U<<28)
#define RCC_C1_AHB4LPENR_ADC3LPEN           (0x1U<<24)
#define RCC_C1_AHB4LPENR_BDMALPEN           (0x1U<<21)
#define RCC_C1_AHB4LPENR_CRCLPEN            (0x1U<<19)
#define RCC_C1_AHB4LPENR_GPIOKLPEN          (0x1U<<10)
#define RCC_C1_AHB4LPENR_GPIOJLPEN          (0x1U<<9)
#define RCC_C1_AHB4LPENR_GPIOILPEN          (0x1U<<8)
#define RCC_C1_AHB4LPENR_GPIOHLPEN          (0x1U<<7)
#define RCC_C1_AHB4LPENR_GPIOGLPEN          (0x1U<<6)
#define RCC_C1_AHB4LPENR_GPIOFLPEN          (0x1U<<5)
#define RCC_C1_AHB4LPENR_GPIOELPEN          (0x1U<<4)
#define RCC_C1_AHB4LPENR_GPIODLPEN          (0x1U<<3)
#define RCC_C1_AHB4LPENR_GPIOCLPEN          (0x1U<<2)
#define RCC_C1_AHB4LPENR_GPIOBLPEN          (0x1U<<1)
#define RCC_C1_AHB4LPENR_GPIOALPEN          (0x1U<<0)

// C1_APB3LPENR Configuration

#define RCC_C1_APB3LPENR_WWDG1LPEN          (0x1U<<6)
#define RCC_C1_APB3LPENR_LTDCLPEN           (0x1U<<3)

// C1_APB1LLPENR Configuration

#define RCC_C1_APB1LLPENR_USART8LPEN        (0x1U<<31)
#define RCC_C1_APB1LLPENR_USART7LPEN        (0x1U<<30)
#define RCC_C1_APB1LLPENR_DAC12LPEN         (0x1U<<29)
#define RCC_C1_APB1LLPENR_HDMICECLPEN       (0x1U<<27)
#define RCC_C1_APB1LLPENR_I2C3LPEN          (0x1U<<23)
#define RCC_C1_APB1LLPENR_I2C2LPEN          (0x1U<<22)
#define RCC_C1_APB1LLPENR_I2C1LPEN          (0x1U<<21)
#define RCC_C1_APB1LLPENR_UART5LPEN         (0x1U<<20)
#define RCC_C1_APB1LLPENR_UART4LPEN         (0x1U<<19)
#define RCC_C1_APB1LLPENR_USART3LPEN        (0x1U<<18)
#define RCC_C1_APB1LLPENR_USART2LPEN        (0x1U<<17)
#define RCC_C1_APB1LLPENR_SPDIFRXLPEN       (0x1U<<16)
#define RCC_C1_APB1LLPENR_SPI3LPEN          (0x1U<<15)
#define RCC_C1_APB1LLPENR_SPI2LPEN          (0x1U<<14)
#define RCC_C1_APB1LLPENR_LPTIM1LPEN        (0x1U<<9)
#define RCC_C1_APB1LLPENR_TIM14LPEN         (0x1U<<8)
#define RCC_C1_APB1LLPENR_TIM13LPEN         (0x1U<<7)
#define RCC_C1_APB1LLPENR_TIM12LPEN         (0x1U<<6)
#define RCC_C1_APB1LLPENR_TIM7LPEN          (0x1U<<5)
#define RCC_C1_APB1LLPENR_TIM6LPEN          (0x1U<<4)
#define RCC_C1_APB1LLPENR_TIM5LPEN          (0x1U<<3)
#define RCC_C1_APB1LLPENR_TIM4LPEN          (0x1U<<2)
#define RCC_C1_APB1LLPENR_TIM3LPEN          (0x1U<<1)
#define RCC_C1_APB1LLPENR_TIM2LPEN          (0x1U<<0)

// C1_APB1HLPENR Configuration

#define RCC_C1_APB1HLPENR_FDCANLPEN         (0x1U<<8)
#define RCC_C1_APB1HLPENR_MDIOSLPEN         (0x1U<<5)
#define RCC_C1_APB1HLPENR_OPAMPLPEN         (0x1U<<4)
#define RCC_C1_APB1HLPENR_SWPLPEN           (0x1U<<2)
#define RCC_C1_APB1HLPENR_CRSLPEN           (0x1U<<1)

