Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_rcc.h
// C1_APB2LPENR Configuration

#define RCC_C1_APB2LPENR_HRTIMLPEN          (0x1U<<29)
#define RCC_C1_APB2LPENR_DFSDM1LPEN         (0x1U<<28)
#define RCC_C1_APB2LPENR_SAI3LPEN           (0x1U<<24)
#define RCC_C1_APB2LPENR_SAI2LPEN           (0x1U<<23)
#define RCC_C1_APB2LPENR_SAI1LPEN           (0x1U<<22)
#define RCC_C1_APB2LPENR_SPI5LPEN           (0x1U<<20)
#define RCC_C1_APB2LPENR_TIM17LPEN          (0x1U<<18)
#define RCC_C1_APB2LPENR_TIM16LPEN          (0x1U<<17)
#define RCC_C1_APB2LPENR_TIM15LPEN          (0x1U<<16)
#define RCC_C1_APB2LPENR_SPI4LPEN           (0x1U<<13)
#define RCC_C1_APB2LPENR_SPI1LPEN           (0x1U<<12)
#define RCC_C1_APB2LPENR_USART6LPEN         (0x1U<<5)
#define RCC_C1_APB2LPENR_USART1LPEN         (0x1U<<4)
#define RCC_C1_APB2LPENR_TIM8LPEN           (0x1U<<1)
#define RCC_C1_APB2LPENR_TIM1LPEN           (0x1U<<0)

// C1_APB4LPENR Configuration

#define RCC_C1_APB4LPENR_SAI4LPEN           (0x1U<<21)
#define RCC_C1_APB4LPENR_RTCAPBLPEN         (0x1U<<16)
#define RCC_C1_APB4LPENR_VREFLPEN           (0x1U<<15)
#define RCC_C1_APB4LPENR_COMP12LPEN         (0x1U<<14)
#define RCC_C1_APB4LPENR_LPTIM5LPEN         (0x1U<<12)
#define RCC_C1_APB4LPENR_LPTIM4LPEN         (0x1U<<11)
#define RCC_C1_APB4LPENR_LPTIM3LPEN         (0x1U<<10)
#define RCC_C1_APB4LPENR_LPTIM2LPEN         (0x1U<<9)
#define RCC_C1_APB4LPENR_I2C4LPEN           (0x1U<<7)
#define RCC_C1_APB4LPENR_SPI6LPEN           (0x1U<<5)
#define RCC_C1_APB4LPENR_LPUART1LPEN        (0x1U<<3)
#define RCC_C1_APB4LPENR_SYSCFGLPEN         (0x1U<<1)
